# Brewfile - foundational dev environment
#
# Maintain with:
#   brew bundle install --file=Brewfile     # install everything declared here
#   brew bundle check   --file=Brewfile     # verify nothing is missing
#   brew bundle dump    --file=Brewfile.local --force --describe   # snapshot current machine
#
# Keep this file foundational. Per-machine extras belong in Brewfile.local
# (which should NOT be committed).

# ---- Taps ----
tap "codacy/tap"                       # Codacy formula tap

# ---- CLI tools (formulae) ----
brew "actionlint"                      # GitHub Actions workflow linter
brew "ansible"                         # configuration management and automation
brew "autoconf-archive"                # extra GNU Autoconf macros
brew "automake"                        # GNU Makefile generator
brew "azure-cli"                       # Azure CLI (`az`)
brew "ccache"                          # compiler cache for C/C++ builds
brew "clang-format"                    # C/C++/Objective-C code formatter
brew "cmake"                           # cross-platform build system
brew "codacy/tap/codacy-analysis-cli"  # Codacy local analysis CLI
brew "dotnet"                          # .NET SDK/runtime CLI (`dotnet`)
brew "gh"                              # GitHub CLI
brew "git"                             # modern Git version control
brew "git-lfs"                         # Git Large File Storage support
brew "gitleaks"                        # secret scanner
brew "gnupg"                           # GPG encryption and signing tools
brew "gnuplot"                         # plotting utility
brew "helm"                            # Kubernetes package manager
brew "jq"                              # JSON command-line processor
brew "kubernetes-cli"                  # Kubernetes CLI (`kubectl`)
brew "libtool"                         # GNU library build helper
brew "llvm"                            # LLVM/Clang compiler toolchain
brew "markdownlint-cli"                # Markdown linter
brew "ninja"                           # fast build system
brew "node"                            # JavaScript/TypeScript runtime
brew "pandoc"                          # universal document converter
brew "pkgconf"                         # pkg-config-compatible metadata tool
brew "powershell"                      # PowerShell shell (`pwsh`)
brew "pylint"                          # Python linter
brew "python@3.13"                     # Python 3 interpreter (`python3`)
brew "pytorch"                         # machine learning tensor library
brew "ripgrep"                        # fast text search (`rg`)
brew "rumdl"                          # fast Markdown linter (Rust)
brew "rustup"                         # Rust toolchain manager
brew "shfmt"                           # shell script formatter
brew "stow"                            # GNU Stow symlink manager
brew "taplo"                           # TOML formatter and language server
brew "texinfo"                         # GNU documentation system
brew "uv"                              # Python package and project manager
brew "yamllint"                        # YAML linter
brew "yasm"                            # assembler
brew "zola"                            # static site generator

# ---- GUI apps + tooling (casks) ----
cask "1password"                      # password manager
cask "1password-cli"                  # 1Password CLI (`op`)
cask "anki"                           # spaced-repetition flashcards
cask "battle-net"                     # Blizzard game launcher
cask "chatgpt"                        # ChatGPT desktop app (Apple Silicon/macOS 14+)
cask "codex-app"                      # Codex desktop app
cask "docker-desktop"                 # Docker Desktop (docker, buildx, compose)
cask "gitkraken"                      # Git GUI client
cask "jetbrains-toolbox"              # JetBrains IDE manager
cask "lycheeslicer"                   # resin 3D printer slicer
cask "mactex"                         # TeX/LaTeX distribution
cask "microsoft-teams"                # Microsoft Teams collaboration app
cask "notion"                         # Notion workspace app
cask "obsidian"                       # Markdown knowledge base
cask "pgadmin4"                       # PostgreSQL administration GUI
cask "proton-mail-bridge"             # Proton Mail IMAP/SMTP bridge
cask "protonvpn"                      # Proton VPN client
cask "slack"                          # team chat client
cask "steam"                          # Steam game launcher
cask "tailscale-app"                  # Tailscale VPN client (`tailscale`)
cask "visual-studio-code"             # Visual Studio Code editor (`code`)
cask "warp"                           # Warp terminal
cask "zed"                            # Zed code editor
cask "zotero"                         # citation and reference manager
