# Brewfile - foundational dev environment
#
# Maintain with:
#   brew bundle install --file=Brewfile     # install everything declared here
#   brew bundle check   --file=Brewfile     # verify nothing is missing
#   brew bundle dump    --file=Brewfile.local --force --describe   # snapshot current machine
#
# Keep this file foundational. Per-machine extras belong in Brewfile.local
# (which should NOT be committed).

# ---- CLI tools (formulae) ----
brew "actionlint"                      # GitHub Actions workflow linter
brew "ansible"                         # configuration management and automation
brew "azure-cli"                       # Azure CLI (`az`)
brew "dotnet"                          # .NET SDK/runtime CLI (`dotnet`)
brew "gh"                              # GitHub CLI
brew "git"                             # modern Git version control
brew "git-lfs"                         # Git Large File Storage support
brew "gitleaks"                        # secret scanner
brew "gnupg"                           # GPG encryption and signing tools
brew "gnuplot"                         # plotting utility
brew "helm"                            # Kubernetes package manager
brew "icu4c"                           # ICU Unicode libraries (keg-only; alias of latest icu4c@XX)
brew "jq"                              # JSON command-line processor
brew "kubernetes-cli"                  # Kubernetes CLI (`kubectl`)
brew "markdownlint-cli"                # Markdown linter
brew "node"                            # JavaScript/TypeScript runtime
brew "pandoc"                          # universal document converter
brew "pkgx"                            # ephemeral repository-scoped developer tools
brew "powershell"                      # PowerShell shell (`pwsh`)
brew "pylint"                          # Python linter
brew "python@3.14"                     # Python 3 interpreter (`python3`)
brew "pytorch"                         # machine learning tensor library
brew "ripgrep"                         # fast text search (`rg`)
brew "rustup"                          # Rust toolchain manager
brew "shfmt"                           # shell script formatter
brew "stow"                            # GNU Stow symlink manager
brew "uv"                              # Python package and project manager
brew "zola"                            # static site generator

# ---- GUI apps + tooling (casks) ----
cask "1password"                      # password manager
cask "1password-cli"                  # 1Password CLI (`op`)
cask "anki"                           # spaced-repetition flashcards
cask "battle-net"                     # Blizzard game launcher
cask "chatgpt"                        # ChatGPT desktop app (replaces deprecated codex-app cask)
cask "docker-desktop"                 # Docker Desktop (docker, buildx, compose)
cask "gitkraken"                      # Git GUI client
cask "jetbrains-toolbox"              # JetBrains IDE manager
cask "lycheeslicer"                   # resin 3D printer slicer
cask "mactex"                         # TeX/LaTeX distribution
cask "microsoft-teams"                # Microsoft Teams collaboration app
cask "notion"                         # Notion workspace app
cask "obsidian"                       # Markdown knowledge base
cask "pgadmin4"                       # PostgreSQL administration GUI
cask "proton-mail-bridge"             # Proton Mail IMAP/SMTP bridge
cask "protonvpn"                      # Proton VPN client
cask "slack"                          # team chat client
cask "steam"                          # Steam game launcher
cask "tailscale-app"                  # Tailscale VPN client (`tailscale`)
cask "visual-studio-code"             # Visual Studio Code editor (`code`)
cask "warp"                           # Warp terminal
cask "windows-app"                    # Microsoft Windows App (RDP client)
cask "zed"                            # Zed code editor
cask "zotero"                         # citation and reference manager
